package lgjt.common.base.constants;

/**
 * 返回码常量类
 * @author daijiaqi
 *
 */
public enum  ReturnCode {
	/**
	 * 兼容后台
	 */
	CODE_1("1","成功"),
	/**
	 * 兼容后台
	 */
	CODE_2("2","未登录"),
	/**
	 * 兼容后台
	 */
	CODE_3("3","无权限"),

    CODE_100000("100000","成功"),
    CODE_101001("101001","服务不可用"),
    CODE_101002("101002","请求被禁止，或无权调用该接口"),
    CODE_101003("101003","传入的接入系统ID（app_id）不对，或未传递接入系统ID"),
    CODE_101004("101004","传入的版本号（api_version）不对，或未传递版本号"),
    CODE_101005("101005","传入的时间戳（timestamp）不对，或未传递时间戳"),
    CODE_101006("101006","缺少Token（auth_token）"),
    CODE_101007("101007","传入的Token（auth_token）不对"),
    CODE_101008("101008","缺少参数签名（param_sign）"),
    CODE_101009("101009","参数签名（param_sign）无效"),
    CODE_101010("101010","服务器生成通讯秘钥错误"),
    CODE_102001("102001","业务参数不合法"),
    CODE_102002("102002","接口调用超时"),
	CODE_102003("102003","系統生成参数规则有误"),
    CODE_103000("103000","用户不存在"),
    CODE_103001("103001","密码错误"),
    CODE_103002("103002","文件上传失败"),
	CODE_103003("103003","摘要文件解析失败"),
	CODE_103004("103004","未找到企业用户信息，或者信息不完整!"),
	CODE_103005("103005","用户绑定失败"),
	CODE_103006("103006","用户已经认证"),
	CODE_103007("103007","用户认证申请已经存在，请不要重复提交"),
	CODE_103008("103008","用户名或手机号重复"),
	CODE_103009("103009","用户名不能为空"),
	CODE_103010("103010","密码不能为空"),
	CODE_103011("103011","手机号不合法"),
	CODE_103012("103012","短信验证码发送失败"),
	CODE_103013("103013","验证码已经存在，请不要重复发送"),
	CODE_103014("103014","短信验证码错误"),
	CODE_103015("103015","确认密码不能位空"),
	CODE_103016("103016","两次密码输入不一致"),
	CODE_103017("103017","用户已经被禁用"),
	CODE_103018("103018","用户密码重置失败"),
	CODE_103019("103019","用户申请认证失败"),
	CODE_103020("103020","获取词典失败"),
	CODE_103021("103021","用户未登录"),
	CODE_103022("103022","用户信息不匹配"),
	CODE_103023("103023","操作失敗"),
	CODE_103024("103024","手机号与用户当前手机号一致，无需修改"),
	CODE_103025("103025","该手机号已经注册"),
	CODE_103026("103026","头像修改失败"),
	CODE_103027("103027","验证码类型无效"),
	CODE_103028("103028","信息不存在"),
	CODE_103029("103029","没有权限"),
	CODE_103030("103030","身份证号不合法"),
	CODE_103031("103031","用户认证信息不存在"),
	CODE_103032("103032","微信用户未绑定"),

    //letter
	CODE_104100("104100","家书不存在"),
	CODE_104101("104101","当前IP点赞超过最大次数"),
	CODE_104102("104102","待审核中的家书不能修改"),


	//love
	CODE_105100("105100","爱情故事不存在"),
	CODE_105101("105101","当前IP点赞超过最大次数"),
	CODE_105102("105102","待审核中的爱情故事不能修改"),
	CODE_105103("105103","没有填写所有的必填字段"),
	CODE_105104("105104","该信息已发布，不能修改"),

	//resource
	CODE_106000("106000","参数不合法"),
	CODE_106001("106001","时间戳超时"),
	//对接系统返回码
	CODE_110010("110010","接口调用不可用"),
	CODE_110011("110011","达到限制条件"),
	/**
	 * 支付
	 */
	CODE_120000("120000","无此订单"),
	;


	
	 // 成员变量  
	private String code;
    private String value;
	
    // 构造方法  
    private ReturnCode(String code, String value) {  
        this.code = code;  
        this.value = value;  
    }

	public String getCode() {
		return code;
	}

	public void setCode(String code) {
		this.code = code;
	}

	public String getValue() {
		return value;
	}

	public void setValue(String value) {
		this.value = value;
	}

	/**
	 * 判断是否一致
	 * @param returnCode 返回code
	 * @return false 不一致，true 一致
	 */
	public boolean codeEquals(ReturnCode returnCode){
		if(returnCode==null){
			return false;
		}
		return this.getCode().equals(returnCode.getCode());
	}

}
